иб/src/DataProcessors/ЗагрузкаДанныхИзФайлаМоя/ЗагрузкаДанныхИзФайлаМоя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхИзФайлаМоя</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеФайла</name>
    <attributes>
      <name>Патент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>кодд</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>год</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегионДопуска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОригинаторПатентообладатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеИспользования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПотребления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокСозревания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРастения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловияВыращивания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Форма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

иб/src/DataProcessors/ЗагрузкаДанныхИзФайлаМоя/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Проводник = Новый ДиалогВыбораФайла (РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "ВЫБЕРИТЕ ФАЙЛ";
	Если Объект.ФорматФайла= "TXT" Тогда
		 Фильтр = "Текстовый документ (*.txt)|*.txt";
	ИначеЕсли Объект.ФорматФайла= "XLS" Тогда
		 Фильтр = "Табличный документ (*.xls)|*.xls";	
	ИначеЕсли Объект.ФорматФайла= "CSV" Тогда
		 Фильтр = "Табличный документ (*.csv)|*.csv";	
	ИначеЕсли Объект.ФорматФайла= "DBF" Тогда
		 Фильтр = "Табличный документ (*.dbf)|*.dbf";	
	ИначеЕсли Объект.ФорматФайла= "XML" Тогда
		 Фильтр = "Табличный документ (*.dbf)|*.xml";	
	 Иначе возврат;
	КонецЕсли;
	
	Проводник.Фильтр =  Фильтр;
	Оповещение = Новый ОписаниеОповещения ("ПослеВыборафайла",ЭтотОбъект);
	Проводник.Показать(Оповещение);
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры)Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
		КонецЕсли; 
	Объект.ПутьКФайлу = ВыбранныеФайлы [0];
КонецПроцедуры
&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	 Объект.ДанныеФайла.Очистить();
    	Если Объект.ФорматФайла = "TXT" Тогда
    ПрочитатьФайл_TXT_CSV ();
         ИначеЕсли Объект.ФорматФайла = "XLS" Тогда
	ПрочитатьФайл_XLS ();
        ИначеЕсли Объект.ФорматФайла = "DBF"  Тогда
	ПрочитатьФайл_DBF ();
КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ПрочитатьФайл_TXT_CSV()
	                                           //для текстового документа шаблон
	
ПоследовательноеЧтение = Истина;
Если ПоследовательноеЧтение Тогда
Текст = Новый ЧтениеТекста;
Текст.Открыть(Объект.ПутьКФайлу);

ТекСтрока = Текст.ПрочитатьСтроку();
Пока ТекСтрока <> Неопределено Цикл
МассивСлов = СтрРазделить (ТекСтрока, ";");
Если МассивСлов.Количество () <3 Тогда
Продолжить;
КонецЕсли; 
НоваяСтрока = Объект.ДанныеФайла.Добавить();
НоваяСтрока.Патент = МассивСлов [0];
НоваяСтрока.Кодд = МассивСлов [1];
НоваяСтрока.Название = МассивСлов [2];
ТекСтрока = Текст.ПрочитатьСтроку();
КонецЦикла; 
Иначе
Текст = Новый ТекстовыйДокумент;
Текст.Прочитать (Объект.ПутьКФайлу);
Для НомерСтроки = 2 По Текст.КоличествоСтрок() Цикл
ТекСтрока = Текст.ПолучитьСтроку(НомерСтроки);
МассивСлов = СтрРазделить (ТекСтрока, ";");
Если МассивСлов.Количество () <3 Тогда
 Продолжить;
 КонецЕсли; 
НоваяСтрока = Объект.ДанныеФайла.Добавить();
НоваяСтрока.Патент = МассивСлов [0];
НоваяСтрока.Кодд = МассивСлов [1];
НоваяСтрока.Название = МассивСлов [2];

КонецЦикла; 

КонецЕсли; 
	

КонецПроцедуры // ПрочитатьФайл_TXT_CSV()
 &НаСервере
Процедура ПрочитатьФайл_XLS_НаСервере()
ТабДок = Новый ТабличныйДокумент;
Попытка

	ТабДок.Прочитать(Объект.ПутьКФайлу,СпособЧтенияЗначенийТабличногоДокумента.Значение);
Исключение
    Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Неудалось прочитать файл по причине;" + ОписаниеОшибки(); 
	Сообщение.Сообщить();
	Возврат;
КонецПопытки; 
    КоличествоСтрок = ТабДок.ВысотаТаблицы;
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
	    СтрокаДанных = Объект.ДанныеФайла.Добавить();
СтрокаДанных.Патент                      = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 1).ТекущаяОбласть.Текст;
СтрокаДанных.Кодд                        = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 2).ТекущаяОбласть.Текст;		
СтрокаДанных.Название                    = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 3).ТекущаяОбласть.Текст;		
СтрокаДанных.Год                         = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 4).ТекущаяОбласть.Текст;
СтрокаДанных.РегионДопуска               = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 5).ТекущаяОбласть.Текст;
СтрокаДанных.ОригинаторПатентообладатель = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 6).ТекущаяОбласть.Текст;
СтрокаДанных.Категория                   = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 7).ТекущаяОбласть.Текст;
СтрокаДанных.НаправлениеИспользования    = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 8).ТекущаяОбласть.Текст;
СтрокаДанных.ПериодПотребления           = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 9).ТекущаяОбласть.Текст;
СтрокаДанных.СрокСозревания              = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 10).ТекущаяОбласть.Текст;
СтрокаДанных.ТипРастения                 = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 11).ТекущаяОбласть.Текст;
СтрокаДанных.УсловияВыращивания          = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 12).ТекущаяОбласть.Текст;
СтрокаДанных.Форма                       = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 13).ТекущаяОбласть.Текст;
//СтрокаДаных.Форма                       = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0" + "C" + 13),ТекущаяОбласть.Текст;

КонецЦикла; 
	

КонецПроцедуры 
&НаКлиенте
Процедура ПрочитатьФайл_XLS()
ПрочитатьФайл_XLS_НаСервере ();
КонецПроцедуры 
                                        //для ДБФ ФАЙЛА ПОДГОТОВКА
&НаКлиенте
Процедура ПрочитатьФайл_DBF ()
ФайлДБФ = Новый XBase;
ФайлДБФ.ОткрытьФайл(Объект.ПутьКФайлу);
Если ФайлДБФ.Первая() = Ложь Тогда
	Возврат;
КонецЕсли;
Пока ФайлДБФ.ВКонце() = Ложь Цикл
НоваяСтрока = Объект.ДанныеФайла.Добавить();
НоваяСтрока.Наименование = ФайлДБФ.PATENT;
НоваяСтрока.Наименование = ФайлДБФ.CODE;
ФайлДБФ.Следующая();
				

КонецЦикла; 
ФайлДБФ.ЗакрытьФайл();	

КонецПроцедуры
